app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
					</td>
					<td><%= book.book_comments.count %>コメント</td>