app/controllers/books_controller.rb

  def show
  	@book = Book.find(params[:id])
    @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to @book, notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "5crut"], ["body", "kbazjy2whjtd572m8dc7"], ["user_id", 2], ["created_at", "2020-04-18 08:07:52.405500"], ["updated_at", "2020-04-18 08:07:52.405500"]]
SELECT "books".* FROM "books"