app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@books = @user.books.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 25], ["OFFSET", 0]]